import 'package:flutter/material.dart';
import 'package:flutter_tech_blog/gen/assets.gen.dart';
import 'data_model.dart';

Map homepageposterMap = {
  'imageAsset': AssetImage(Assets.images.programming.path),
  'writer': 'ملیکا عزیزی',
  'date': 'یک روز پیش',
  'title': 'دوازده قدم برنامه نویسی در یک دوره',
  'view': '255'
};

List<HashTags> taglist = [
  HashTags(title: 'جاوا'),
  HashTags(title: 'کاتلین'),
  HashTags(title: 'پایتون'),
  HashTags(title: 'روبی'),
  HashTags(title: 'دارت'),
  HashTags(title: 'iot'),
  HashTags(title: 'go'),
  HashTags(title: 'لینکوس'),
  HashTags(title: 'C++'),
];

List<HashTags> selectedtags = [];

List<Blogmodel> bloglist = [
  Blogmodel(
    id: 0,
    imageurl: 'https://static.digiato.com/digiato/2023/06/1-2-910x600.jpg',
    title: 'کشف یک فوران بخار آب ۱۰٬۰۰۰ کیلومتری در قمر زحل',
    writer: 'رضا زارع پور',
    writerimageurl:
        'https://digiato.com/wp-content/uploads/avatars/226534-142x142.jpeg',
    date: 'یک روز پیش',
    content:
        '''ستون رکوردشکن تقریباً ۱۰٬۰۰۰ کیلومتر وارد فضا می‌شود — فاصلهٔ میان ایرلند و ژاپن — و با نرخ تخمینی ۳۰۰ لیتر بر ثانیه آب را وارد خلأ می‌کند.

انسلادوس، که میزبان اقیانوس عمیقی زیر پوسته‌ی بیرونی‌اش است، در فوران آب به فضا مشهور است؛ اما این اولین بار است که چنین فوران بزرگی از این قمر که تنها ۵۰۰ کیلومتر شعاع دارد دیده می‌شود.

جرونیمو ویلانوئوا (Geronimo Villanueva)، نویسنده‌ی اول مقالهٔ منتشرشده در این مورد و دانشمند سیاره‌ای مرکز پرواز فضایی گدارد ناسا در ایالت مریلند آمریکا، می‌گوید «ما واقعاً از بزرگی و گستردگی این فوران غافلگیر شده بودیم. مطمئن نبودی که انتظار چه چیزی را داشته باشیم.»

پژوهشگران انسلادوس، ششمین قمر بزرگ زحل را، پاییز گذشته با تلسکوپ فضایی جیمز وب رصد کردند. تصاویر گرفته‌شده با ابزار طیف‌نگار فروسرخ نزدیک تلسکوپ چیزی را ثبت کردند که دانشمندان «فورانی خارق‌العاده بزرگ» نامیده‌اند.

اندازه‌گیری‌های تلسکوپ نشان می‌دهند که انسلادوس در این فوران ۳۰۰ کیلوگرم آب در ثانیه از دست می‌داد؛ میزانی کافی برای پر کردن یک استخر المپیک در چند ساعت. ''',
    view: '225',
  ),
  Blogmodel(
    id: 1,
    imageurl:
        'https://files.virgool.io/upload/users/2571623/posts/o2d9unv5ocvx/e3uiwkmptvvg.jpg',
    title: 'کشف یک فوران بخار آب ۱۰٬۰۰۰ کیلومتری در قمر زحل',
    writer: 'رضا زارع پور',
    writerimageurl:
        'https://digiato.com/wp-content/uploads/avatars/226534-142x142.jpeg',
    date: 'یک روز پیش',
    content:
        '''ستون رکوردشکن تقریباً ۱۰٬۰۰۰ کیلومتر وارد فضا می‌شود — فاصلهٔ میان ایرلند و ژاپن — و با نرخ تخمینی ۳۰۰ لیتر بر ثانیه آب را وارد خلأ می‌کند.

انسلادوس، که میزبان اقیانوس عمیقی زیر پوسته‌ی بیرونی‌اش است، در فوران آب به فضا مشهور است؛ اما این اولین بار است که چنین فوران بزرگی از این قمر که تنها ۵۰۰ کیلومتر شعاع دارد دیده می‌شود.

جرونیمو ویلانوئوا (Geronimo Villanueva)، نویسنده‌ی اول مقالهٔ منتشرشده در این مورد و دانشمند سیاره‌ای مرکز پرواز فضایی گدارد ناسا در ایالت مریلند آمریکا، می‌گوید «ما واقعاً از بزرگی و گستردگی این فوران غافلگیر شده بودیم. مطمئن نبودی که انتظار چه چیزی را داشته باشیم.»

پژوهشگران انسلادوس، ششمین قمر بزرگ زحل را، پاییز گذشته با تلسکوپ فضایی جیمز وب رصد کردند. تصاویر گرفته‌شده با ابزار طیف‌نگار فروسرخ نزدیک تلسکوپ چیزی را ثبت کردند که دانشمندان «فورانی خارق‌العاده بزرگ» نامیده‌اند.

اندازه‌گیری‌های تلسکوپ نشان می‌دهند که انسلادوس در این فوران ۳۰۰ کیلوگرم آب در ثانیه از دست می‌داد؛ میزانی کافی برای پر کردن یک استخر المپیک در چند ساعت. ''',
    view: '225',
  ),
  Blogmodel(
    id: 2,
    imageurl:
        'https://files.virgool.io/upload/users/2535824/posts/w5uhyvhuzfo2/vqrcxbeczuwz.jpg',
    title: 'کشف یک فوران بخار آب ۱۰٬۰۰۰ کیلومتری در قمر زحل',
    writer: 'رضا زارع پور',
    writerimageurl:
        'https://digiato.com/wp-content/uploads/avatars/226534-142x142.jpeg',
    date: 'یک روز پیش',
    content:
        '''ستون رکوردشکن تقریباً ۱۰٬۰۰۰ کیلومتر وارد فضا می‌شود — فاصلهٔ میان ایرلند و ژاپن — و با نرخ تخمینی ۳۰۰ لیتر بر ثانیه آب را وارد خلأ می‌کند.

انسلادوس، که میزبان اقیانوس عمیقی زیر پوسته‌ی بیرونی‌اش است، در فوران آب به فضا مشهور است؛ اما این اولین بار است که چنین فوران بزرگی از این قمر که تنها ۵۰۰ کیلومتر شعاع دارد دیده می‌شود.

جرونیمو ویلانوئوا (Geronimo Villanueva)، نویسنده‌ی اول مقالهٔ منتشرشده در این مورد و دانشمند سیاره‌ای مرکز پرواز فضایی گدارد ناسا در ایالت مریلند آمریکا، می‌گوید «ما واقعاً از بزرگی و گستردگی این فوران غافلگیر شده بودیم. مطمئن نبودی که انتظار چه چیزی را داشته باشیم.»

پژوهشگران انسلادوس، ششمین قمر بزرگ زحل را، پاییز گذشته با تلسکوپ فضایی جیمز وب رصد کردند. تصاویر گرفته‌شده با ابزار طیف‌نگار فروسرخ نزدیک تلسکوپ چیزی را ثبت کردند که دانشمندان «فورانی خارق‌العاده بزرگ» نامیده‌اند.

اندازه‌گیری‌های تلسکوپ نشان می‌دهند که انسلادوس در این فوران ۳۰۰ کیلوگرم آب در ثانیه از دست می‌داد؛ میزانی کافی برای پر کردن یک استخر المپیک در چند ساعت. ''',
    view: '225',
  ),
  Blogmodel(
    id: 3,
    imageurl:
        'https://files.virgool.io/upload/users/2571935/posts/gjffam8op7sh/29jsauagnygl.webp',
    title: 'کشف یک فوران بخار آب ۱۰٬۰۰۰ کیلومتری در قمر زحل',
    writer: 'رضا زارع پور',
    writerimageurl:
        'https://digiato.com/wp-content/uploads/avatars/226534-142x142.jpeg',
    date: 'یک روز پیش',
    content:
        '''ستون رکوردشکن تقریباً ۱۰٬۰۰۰ کیلومتر وارد فضا می‌شود — فاصلهٔ میان ایرلند و ژاپن — و با نرخ تخمینی ۳۰۰ لیتر بر ثانیه آب را وارد خلأ می‌کند.

انسلادوس، که میزبان اقیانوس عمیقی زیر پوسته‌ی بیرونی‌اش است، در فوران آب به فضا مشهور است؛ اما این اولین بار است که چنین فوران بزرگی از این قمر که تنها ۵۰۰ کیلومتر شعاع دارد دیده می‌شود.

جرونیمو ویلانوئوا (Geronimo Villanueva)، نویسنده‌ی اول مقالهٔ منتشرشده در این مورد و دانشمند سیاره‌ای مرکز پرواز فضایی گدارد ناسا در ایالت مریلند آمریکا، می‌گوید «ما واقعاً از بزرگی و گستردگی این فوران غافلگیر شده بودیم. مطمئن نبودی که انتظار چه چیزی را داشته باشیم.»

پژوهشگران انسلادوس، ششمین قمر بزرگ زحل را، پاییز گذشته با تلسکوپ فضایی جیمز وب رصد کردند. تصاویر گرفته‌شده با ابزار طیف‌نگار فروسرخ نزدیک تلسکوپ چیزی را ثبت کردند که دانشمندان «فورانی خارق‌العاده بزرگ» نامیده‌اند.

اندازه‌گیری‌های تلسکوپ نشان می‌دهند که انسلادوس در این فوران ۳۰۰ کیلوگرم آب در ثانیه از دست می‌داد؛ میزانی کافی برای پر کردن یک استخر المپیک در چند ساعت. ''',
    view: '225',
  ),
];
